#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//int main()
//{
//	//操作符：/ %
//	int a = 5 / 2;//商2余1，结果为2
//	printf("a=%d\n", a);
//	// 由于/两边都是整数，那么结果也是证整数
//
//	double c = 5 / 2.0;
//	printf("c=%lf\n", c);//2.5
//
//	//对于取模运算来说左右操作数都必须是整数
//	int b = 5 % 2;//%得到的是余数
//	printf("b=%d\n", b);
//	return 0;
//}
int main()
{
	int a = -1;
	//负数是用补码存储的
	//10000000 00000000 00000000 00000001（原码
	// 11111111 11111111 11111111 11111110（反码
	// 11111111 11111111 11111111 11111111（补码
	//>>右移操作符：移动的是二进制位
	//1、算术右移
	// 右边丢弃，左边补原符号位
	//2、逻辑右移
	//右边丢弃，左边补零
	int b=a >> 1;
	printf("b=%d", b);//结果：-1，说明是算术右移
	return 0;
}