#define _CRT_SECURE_NO_WARNINGS 1


#include<stdio.h>

//int main()
//{
	//int a = 0;
	//char b = 'w';
	//int arr[10] = { 0 };

	//printf("%d\n", sizeof(a));
	//printf("%d\n", sizeof a );
	//printf("%d\n", sizeof(int));

	//printf("%d\n", sizeof(b));
	//printf("%d\n", sizeof(char));

	//printf("%d\n", sizeof(arr));//10*4
	//printf("%d\n", sizeof(int [10]));//数组的类型

	//short s = 0;
	//int a = 10;
	//printf("%d\n", sizeof(s = a + 5));//sizeof中的表达式不参与运算
	//printf("%d\n", s);

	////按位取反~，按二进制位取反，对于负数的符号位也要取反
	//int a = 0;
	////00000000 00000000 00000000 00000000
	////11111111 11111111 11111111 11111111(补码)
	////11111111 11111111 11111111 11111110
	////10000000 00000000 00000000 00000001(原码)
	////-1
	//printf("%d\n", ~a);

	////按位或|和按位或&
	//int b = 11;
	//printf("%d\n", (1 << 2 )|b);
	//printf("%d\n", (~(1 << 2)) & b);

	//int a = 10;
	////前置++，先++，后使用
	//printf("%d\n", ++a);//11
	////后置++，先使用，后++
	//printf("%d\n", a++);//11
	//printf("%d\n", a);//12

	//强制类型转换
	/*int a = (int)3.14;*/

	////逻辑操作符
	////逻辑与&&、逻辑或||
	////真假判断
	//int a = 3;
	//int b = 5;
	//int c = a && b;
	//printf("%d\n", c);//1
	//int d = 0;
	//printf("%d\n", a || d);
	////如果逻辑与&&操作符第一个数为假接下来的就不用计算了
	//int i = d && a++ && b && c;
	//printf("%d\n", a );//a=3
	////如果逻辑或||操作符第一个数为真接下来的就不用计算了
	//int j = (d+1) || a++ || b || c;
	//printf("%d\n", a);//a=3

	////条件操作符：exp1?exp2:exp3
	//int b;
	//int a = 6;
	//int c=(a > 5) ? (b = 3) : (b = -3);//a>5为真，b=3；反之b=-3
	//printf("%d\n", c);//3

	////逗号表达式：exp1,exp2,exp3......
	////从左往右依次执行，整个表达式的结果就是最后一个表达式的结果
	//int a = 1;
	//int b = 2;
	//int c = (a > b, a = b + 10, a, b = a + 1);//13
	//printf("%d\n", c);

	////函数调用操作符
	//int a = 10;
	//int b = 20;
	////调用函数时用的()就是函数调用操作符,get_max、a、b都是操作数
	//int max = get_max(a, b);//get_max是自定义函数
	//printf("max=%d\n", max);


//	return 0;
//}


//	//访问结构体成员
////创建一个结构体类型-struct stu
//	struct stu
//	{
//		//成员变量
//		char name[20];
//		int age;
//		char id[20];
//	};
//	int main()
//	{
//		//使用structstu创建了一个学生对象s1，并初始化
//		struct stu s1 = { "张三",20,"12128" };
//		printf("%s\n", s1.name);
//		printf("%d\n", s1.age);
//		printf("%s\n", s1.id);
//		//结构体变量.成员名
//		printf("\n");
//		struct stu* ps=&s1;
//		printf("%s\n", ps->name);
//		printf("%d\n", ps->age);
//		printf("%s\n", ps->id);
//		//结构体指针变量->成员名
//
//
//		return 0;
//	}

int main()
{
	////整型提升：为了获得精度，表达式中的字符和短整型操作数在使用前会被转换成普通整型，这种转换称为整型提升
	//char a = 3;
	////00000000 00000000 00000000 00000011
	////00000011 char是一个字节，只能放8个比特位，会发生截断
	//char b = 127;
	////同上：01111111 
	//char c = a + b;
	////a+b
	////整型提升的过程：（变整型）
	////00000000 00000000 00000000 00000011
	////00000000 00000000 00000000 01111111 
	////相加：
	////00000000 00000000 00000000 10000010
	////c-10000010=-126
	//printf("%d\n", c);//c=-126
	////整型打印，需要再次整型提升
	////11111111 11111111 11111111 10000010 - 补码
	////11111111 11111111 11111111 10000001 - 反码
	////10000000 00000000 00000000 01111110 - 原码 - -126
	//算术运算才会发生整型提升

	//  操作符的优先级
	int a = 10;
	int b = 20;
	int c = b + a * 3;
	//优先级高的先算
	//运算符混合使用时要尽量避免产生歧义


	return 0;
}